[
    {
        "kind": "Listing",
        "data": {
            "after": null,
            "dist": 1,
            "modhash": "",
            "geo_filter": "",
            "children": [
                {
                    "kind": "t3",
                    "data": {
                        "approved_at_utc": null,
                        "subreddit": "BurryEdge",
                        "selftext": "I run a small hedge fund based out of Raleigh, NC. Myself and my Fund are long $HAYPP. Please see the disclaimer at the bottom of the post. For more blog posts like this check out my Fund's blog at [https://www.rogue-funds.com/blog](https://www.rogue-funds.com/blog)\n\n*All Financial Figures are in USD unless otherwise specified.*\n\nI think HAYPP Group, the biggest online retailer of nicotine pouches, can capture a huge chunk of the sales in what I believe will be the biggest form of nicotine intake growth over the next 10-15 years.\n\nThe future of nicotine consumption will be nicotine pouches and it is growing at an unprecedented rate. Here in the States the go to item for nicotine pouches are Zyn’s (owned by Philip Morris), in Europe it’s Velo (owned by British American Tobacco), but there are various other brands that all catching fire: ON! (Altria), Rogue, Juice Head, FRE, Lucy, and Sesh, among various others.\n\n**What is HAYPP?**\n\n*Brief History*\n\nHAYPP is an online retailer and distributor of nicotine pouches and snus. The company was started by a couple of Swedish teenagers in 2009 and through mergers and acquisitions they no longer are in charge of the company as the current CEO joined in 2017/2018. The company bought Nicokick.com and northerner.com (northerner owns 9% of stock) which are now both of their main American brands. They switched from Snus to Nicotine Pouches 6 years ago and haven’t looked back.\n\n[Domains Owned By HAYPP Group](https://preview.redd.it/gr3kxwm5anzc1.png?width=975&amp;format=png&amp;auto=webp&amp;s=383bb5d7ac692fe7323192c608ae812b46f4e7c1)\n\nHAYPP currently owns a roughly 85% online market share for their Nordic part of the business, which they refer to as their “core” business as well as a \\~55% market share of the oral nicotine market (85% market share of the nicotine pouch e-commerce market) for their growth market which is considered the US, UK, Germany, and Swiss countries.\n\n[Market Share of HAYPP](https://preview.redd.it/r9y53fg7anzc1.png?width=975&amp;format=png&amp;auto=webp&amp;s=b11912ca8e532bc15d9b2d918bc4fa2673c3a917)\n\n[HAYPP vs Closest Competitor in each Market](https://preview.redd.it/dsu4sxm8anzc1.png?width=975&amp;format=png&amp;auto=webp&amp;s=82be786825f001a4617db95ea6b88795b16aaeb0)\n\n*SEO Powerhouse*\n\nSo how do they have such a grasp on what would obviously be a hyper competitive online industry? The main reason for their hyper success in the online market is that they have a death grip on the SEO landscape. Their mastery of SEO allows them to spend almost nothing on marketing and to keep pushing out their distribution system (which continues to drive costs down for them and consumers). This creates a positive feedback loop as they become even cheaper than their competitors, allowing them to lock in customers (over 90% of the customers becoming recurring customers).\n\n[How Consumers find HAYPP](https://preview.redd.it/qevmp0qaanzc1.png?width=643&amp;format=png&amp;auto=webp&amp;s=ad031f2035197c31f321a03926d954b33f2357b4)\n\n[HAYPP Marketing Expenses as a &amp;#37; of Sales](https://preview.redd.it/fru8h8xbanzc1.png?width=683&amp;format=png&amp;auto=webp&amp;s=5a9e6014be0a78d76582c962afb0219ebfd53778)\n\nIf you google just about anything related to Nicotine pouches, there is probably a 95%+ chance that the top unpaid search result will be a HAYPP Group Domain. Even niche searches such as “what is an upper decky” (Gen. Z slang for nicotine pouches) or basic searches such as “what are the top nicotine pouches” you will see that HAYPP Group owns the top of the search.\n\nhttps://preview.redd.it/e7ocu0jdanzc1.png?width=975&amp;format=png&amp;auto=webp&amp;s=f8e80b8d743de3dc9133504bd6ff85dbbaee48bb\n\n[Google Searches Highlighting the SEO power of HAYPP](https://preview.redd.it/symd8zueanzc1.png?width=975&amp;format=png&amp;auto=webp&amp;s=176783915281075fdb07a1b83ee6b18f2978f24c)\n\nThis is huge when sites like Google severely limit the amount of advertising that addictive products can utilize on their search engine. HAYPP ends up barely spending anything on marketing due to 40% of new customers coming through word of mouth and the rest from SEO.\n\n*Data*\n\nTheir other field of expertise is data collection and selling. Due to the large variety of pouches and being the number one online seller of nicotine pouches, they have created a major database which they sell to various nicotine pouch producers such as Philip Morris and Altria. Producers buy these on an annualized basis, and you can see the usage of their data among the investor relation reports/presentations/websites of various producers. As you can see from my beautiful pictures on this post, they compile plenty of data to help me understand the business better.\n\n \n\n*Lowest Cost Seller and Best E-Commerce Distribution*\n\nDue to their distribution network, HAYPP has become one of the cheapest (if not the cheapest) sellers of nicotine pouches in the world. You can buy Zyn’s cheaper from HAYPP websites than you can from the ZYN website. Haypp’s prices are 20-40% cheaper than grocery stores and 30-50% cheaper than convenience stores.\n\nThey have been integrating their distribution network so that most variable costs are being converted to vertical fixed costs creating operating leverage for them as they rapidly scale their revenue and are able to increase margins. They have implemented 2-day delivery across the US and close to implementing across Europe markets as well.\n\nhttps://preview.redd.it/0sajvfgkanzc1.png?width=975&amp;format=png&amp;auto=webp&amp;s=3aad16b9df1be7bf6bbcc8f16ebf8c469c15b3a0\n\n[HAYPP Distribution](https://preview.redd.it/cbanlyvlanzc1.png?width=975&amp;format=png&amp;auto=webp&amp;s=537d2414b3c56538902bbf1594f78fe77b44f089)\n\n*Leveraging Market Share for High Quality New Products*\n\nThe last part of their business model is their ability to leverage their large consumer base to help new products capture market share, which allows them to capture higher margins on their products and it increases the variety of products which consumers would like to buy. In Nordic countries the variety of products is a benefit to them as consumers want to try various brands and flavors. When this competition trend hits the US it will only benefit them even more.\n\n \n\n**Why Haypp vs Pouch Companies**\n\nCurrently in the US there are only a couple main brands with Zyn owning a huge chunk of the market. In Europe, Velo is the most popular brand but there are many Nordic brands that consistently attack margins and currently there is little competition in the US market which most likely won’t last much longer. As consumers search out the cheapest product and try to hunt for variety, HAYPP will be that future as convenience stores lag in variety and cost.\n\nProducts such as Zyn will definitely continue to grow (currently Zyn is growing at 70% y/y) but we could see margins shrink as competition becomes fiercer and consumers branch out away from the first movers, although Zyn continues to take up 70% of the US market. This only further benefits HAYPP as they are the go-to spot for a large amount of variety. Although they don’t benefit as much from less competition, they are still beneficiaries of an oligopoly esque market due to their cost and distribution networks.\n\nMost large publicly traded pouch companies are also cigarette and chewing tobacco sellers who are rapidly seeing those segments get cannibalized by vaping and nicotine pouches combined with regulatory crackdown risk. Since HAYPP has no exposure to either one, you will not experience any cannibalization outside of snus cannibalization in the Nordics. This is the best pure play bet on nicotine pouch consumption.\n\nCertain countries have limited the ability for consumers to have access to nicotine via retail stores which will allow them to take huge shares of the overall market in places like Germany or in California where they have banned flavored nicotine products in retail stores has led to windfall of customers to HAYPP’s e-commerce model.\n\n \n\n**Management**\n\nThe current CEO of HAYPP group, Gavin O’Dowd, used to work for British American Tobacco (BAT) and was the driving force for the VELO acquisition. He currently owns 3.6% of the stock and various other PE firms and Family Offices own large chunks of HAYPP. Most executives have warrants that could give them the right to 200k-400k shares each (29m shares outstanding with no serious history of dilution).\n\n \n\n**Regulations**\n\nAs many of you are aware, regulations are a huge part of the nicotine industry. Taxes are going to be huge risks, which are then combined with flavor bans. I think nicotine pouches are one of the products that are least likely to get hit with serious bans since their health risk is much lower than almost any other nicotine product.\n\nThe nicotine pouch industry as a whole has been behaving spectacularly well when it comes to ensuring they are not purposefully marketing to young people. They are trying to avoid having a Juul 2.0 fiasco which basically murdered that business and completely fragmented the vaping industry which is on the brink of regulatory crack down.\n\nHAYPP does their part by ensuring age regulation across their whole site. They have age verification to order and deliver. They have a huge emphasis on ensuring that they abide by the law.\n\n \n\n**Financials**\n\n*Core Segment (Nordic Countries)*\n\nThe company is growing heavily in every segment that it operates in. Its core segment seems to be slowing down in growth due to heavy cannibalization from snus sales. This should only be temporary as nicotine pouch volume grows at 30%+ y/y. Once snus nears its cannibalization endpoint, I would expect revenue to begin growing again in its core market (although not at 30%). Current revenue is $250m USD and EBITDA is about $18m USD for just the core segment for the last twelve months. Management expects high single digit EBITDA margins for 2025.\n\n[Core Segment Sales and EBITDA Margin](https://preview.redd.it/yzcdzgtoanzc1.png?width=526&amp;format=png&amp;auto=webp&amp;s=b25fafa6bcdf821a4a36de2cafa09aaa625b67bf)\n\n*Growth Segment (US, UK, Germany, Switzerland)*\n\nThe growth segment is skyrocketing. Growth is over 46% y/y and this growth has been consistent and should continue to be consistent. EBITDA margin for the growth markets has begun to inflect positively which will cause a massive amount of leverage in their EBITDA to occur as their fixed cost model begins to do its job. As economies of scale drive forward, we should see this margin increase substantially over the coming years. Currently Revenue is at $77m USD for growth markets and EBITDA is at -$3.5m USD.\n\n[Growth Segment Sales and EBITDA Margin](https://preview.redd.it/5dwt225qanzc1.png?width=515&amp;format=png&amp;auto=webp&amp;s=09f25d4e92c17667ae4129e1d28e0b3a0be59a9b)\n\n*Let’s Talk about the Growth Segment a bit more.*\n\nThis is where the real value from HAYPP will come into play. While it currently begins to inflect positive in terms of profitability, it should be noted that the Growth markets have a massive TAM compared to their core market and could cause the company to 5x in the next few years if they maintain or gain market share and continue to grow in these massive TAMs.\n\n*Total TAM growth*\n\nAs they grow, their competitive advantage deepens due to sticky customers and cheaper products from economies of scale. The US has an even faster scale of 49%+ growth y/y and HAYPP is outpacing the US nicotine pouch growth at 57% y/y. As the US begins to approve various products and variety begins to flood the US market, a ton of US users want to try various Nordic brands that don’t have access which lends a very strong lean towards an online website such as HAYPP. The US is a very ripe environment along with the UK and Germany (where nicotine can only be sold online) for HAYPP to continue to outperform massively.\n\n*Emerging Segment*\n\nTheir “emerging” segment is where they have begun to introduce vapes into their value chain. HAYPP is beginning to sell vapes to UK and Germany, but it is at the very beginning stages and has no current significant impact on their bottom or top line. The company says the growth they are experiencing in this segment has been very similar to the growth that they experienced when they introduced Nicotine Pouches in growth markets. This is the most likely segment to get hit with regulatory concerns, so for now I won’t even consider this in a to be a profitable unit and will just assume it will be a small drain on EBITDA for the foreseeable future.\n\n*Balance Sheet*\n\nThe balance sheet is great with no large debt burden and good working capital management. As they hit profitability this year/early next year I would expect a cash build up until the company decides if they will be returning cash to shareholders or reinvesting in the business.\n\n \n\n**Valuation**\n\nHAYPP is extremely undervalued based on where they are from a profitability standpoint and their current inflection point. Due to their high growth, it will be hard to pinpoint an exact value on them so this will merely be an exercise in estimating their value among a range more than usual (anyone who claims they can perfectly value a high growth company is probably overvaluing due to unsound conviction).\n\n First let’s look at how they are currently valued, which is roughly 14x their **core** EBITDA. Now let’s take a second and think about how insane that statement was. Their core market is the Nordic countries which will be hitting growth again as their snus cannibalization slows, the Nordic countries basically have no further regulation risk for nicotine pouches, and it is a noncyclical industry. I would argue that 14x their core EBITDA is probably an appropriate valuation based on **only** their core segment.\n\nWhat this means is (if you haven’t noticed already) that you are getting their “growth” segment for **free** based on the valuation of the stock. The growth segment alone is probably worth multiples of the current stock price due to the massive TAM and extreme growth prospects. If we assume the emerging segment is worthless (which it isn’t and it will be profitable at some point) then that means all of the upside in the stock can be based on what the value of the growth segment. Based on TAM, growth, and lack of cyclicality then this leaves the only risk as regulation.\n\nThere will most likely be some sort of regulation, but we are very far from that as the Tobacco industry has been very careful in how they implement their new nicotine pouch momentum in a more appropriate way compared to vapes. The most likely regulations will probably be flavor bans of some sort or retail bans (which further benefits HAYPP). Regulations will most likely be limited in scope due to just the sheer lack of mortality risk associated with pouches vs any other form of common nicotine intake.\n\nBased on their probable conservative revenue growth (40% average for the next 3 years, and 15% after that), EBITDA growth, the fact that they will have both core and growth markets at high single digit EBITDA margins in 2025, and their lack of cyclicality, then I would estimate that their Growth markets are worth a very conservative $400m-$500m USD. I am likely undershooting the valuation because they are driving profitability very fast and their revenue is growing closer to 40%-60% in growth markets right now. If they are able to keep up current growth figures and expand to double digit margins before the end of the decade then they could be worth 2x-3x this value (which is why valuing growth companies are so hard, because I can’t foresee the future). Again, I valued the emerging segment as worthless which is unlikely as well.\n\nSo, based on the value of $450m USD for the growth markets and the current value of $240 USD for the Nordic markets, that would create a sum of the parts equal to roughly $700m or nearly triple the current share price. This valuation leaves a ton of room for margin expansion and higher growth prospects because let’s face it, the US alone is probably worth at least 3x-5x more than the Nordic countries not including the UK, Germany, or Swiss. This is a very conservative valuation for the company, but it shows how great the risk/reward is based on the current price. Using a conservative valuation here also helps accommodate for regulation risk.\n\nIn SEK terms this would be 250 SEK/share or 7.35B SEK.\n\n**Conclusion**\n\nEven accommodating for regulation risk, a valuation of $700m seems appropriate as a starting point for the valuation for HAYPP Group. I think there is a very high likelihood that I could be off on this by a large margin, but I feel like the downside is very protected with this valuation. Management has been great in execution and I expect that to continue. In a more bullish case where every segment of the company fires on all cylinders we could see a valuation of $1.5B+, but that is not a scenario that I would like to bet my investors’ money on. For now, I will stay invested and keep watching them execute and adjust my valuation accordingly.\n\n*Disclaimer: The author of this idea and his Fund have a position in securities discussed at the time of posting and may trade in and out of this position without informing the reader.*\n\n*Opinions expressed herein by the author are not an investment recommendation and are not meant to be relied upon in investment decisions. The author is not acting in an investment adviser capacity. This is not an investment research report. The author's opinions expressed herein address only select aspects of potential investment in securities of the companies mentioned and cannot be a substitute for comprehensive investment analysis. Any analysis presented herein is illustrative in nature, limited in scope, based on an incomplete set of information, and has limitations to its accuracy. The author recommends that potential and existing investors conduct thorough investment research of their own, including detailed review of the companies' SEC and CSA filings, and consult a qualified investment adviser. The information upon which this material is based was obtained from sources believed to be reliable, but has not been independently verified. Therefore, the author cannot guarantee its accuracy. Any opinions or estimates constitute the author's best judgment as of the date of publication and are subject to change without notice. The author and funds the author advises may buy or sell shares without any further notice.*  \n*This article may contain certain opinions and “forward-looking statements,” which may be identified by the use of such words as “believe,” “expect,” “anticipate,” “should,” “planned,” “estimated,” “potential,” “outlook,” “forecast,” “plan” and other similar terms. All such opinions and forward-looking statements are conditional and are subject to various factors, including, without limitation, general and local economic conditions, changing levels of competition within certain industries and markets, changes in legislation or regulation, and other economic, competitive, governmental, regulatory and technological factors, any or all of which could cause actual results to differ materially from projected results.*",
                        "user_reports": [],
                        "saved": false,
                        "mod_reason_title": null,
                        "gilded": 0,
                        "clicked": false,
                        "title": "HAYPP Group: Capitalizing on the Nicotine Pouch Craze",
                        "link_flair_richtext": [],
                        "subreddit_name_prefixed": "r/BurryEdge",
                        "hidden": false,
                        "pwls": null,
                        "link_flair_css_class": null,
                        "downs": 0,
                        "thumbnail_height": 78,
                        "top_awarded_type": null,
                        "parent_whitelist_status": null,
                        "hide_score": false,
                        "media_metadata": {
                            "gr3kxwm5anzc1": {
                                "status": "valid",
                                "e": "Image",
                                "m": "image/png",
                                "p": [
                                    {
                                        "y": 15,
                                        "x": 108,
                                        "u": "https://preview.redd.it/gr3kxwm5anzc1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=3b28b265ee21748c3f456539bddac12c69929a86"
                                    },
                                    {
                                        "y": 30,
                                        "x": 216,
                                        "u": "https://preview.redd.it/gr3kxwm5anzc1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=b6d2cb39f7aa9cb44b19c2829ee78156c4b7f7e9"
                                    },
                                    {
                                        "y": 45,
                                        "x": 320,
                                        "u": "https://preview.redd.it/gr3kxwm5anzc1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=d989281c0789ba293a76f08c97a03de3bd4918cc"
                                    },
                                    {
                                        "y": 91,
                                        "x": 640,
                                        "u": "https://preview.redd.it/gr3kxwm5anzc1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=06a367cf5ef606740f549533141e1de4f6d2fe32"
                                    },
                                    {
                                        "y": 136,
                                        "x": 960,
                                        "u": "https://preview.redd.it/gr3kxwm5anzc1.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=247d4c1b0b482a8589ffa72b8db3b5428eca5dcb"
                                    }
                                ],
                                "s": {
                                    "y": 139,
                                    "x": 975,
                                    "u": "https://preview.redd.it/gr3kxwm5anzc1.png?width=975&amp;format=png&amp;auto=webp&amp;s=383bb5d7ac692fe7323192c608ae812b46f4e7c1"
                                },
                                "id": "gr3kxwm5anzc1"
                            },
                            "r9y53fg7anzc1": {
                                "status": "valid",
                                "e": "Image",
                                "m": "image/png",
                                "p": [
                                    {
                                        "y": 47,
                                        "x": 108,
                                        "u": "https://preview.redd.it/r9y53fg7anzc1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=c6d9f9cf1fcebd9d999eb735d821134c90c85f77"
                                    },
                                    {
                                        "y": 94,
                                        "x": 216,
                                        "u": "https://preview.redd.it/r9y53fg7anzc1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=46ba68e7336a29c2369ea67742a6f2d5f02684b5"
                                    },
                                    {
                                        "y": 140,
                                        "x": 320,
                                        "u": "https://preview.redd.it/r9y53fg7anzc1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=8d0b74fc554f5e076f15bd5d305c6233439dd5bc"
                                    },
                                    {
                                        "y": 280,
                                        "x": 640,
                                        "u": "https://preview.redd.it/r9y53fg7anzc1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=bef1d250ed4649b9e15a90fc89d8d1426af2d312"
                                    },
                                    {
                                        "y": 420,
                                        "x": 960,
                                        "u": "https://preview.redd.it/r9y53fg7anzc1.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=f52cc5ad788a6733ce11660f17200f9694f79e99"
                                    }
                                ],
                                "s": {
                                    "y": 427,
                                    "x": 975,
                                    "u": "https://preview.redd.it/r9y53fg7anzc1.png?width=975&amp;format=png&amp;auto=webp&amp;s=b11912ca8e532bc15d9b2d918bc4fa2673c3a917"
                                },
                                "id": "r9y53fg7anzc1"
                            },
                            "symd8zueanzc1": {
                                "status": "valid",
                                "e": "Image",
                                "m": "image/png",
                                "p": [
                                    {
                                        "y": 33,
                                        "x": 108,
                                        "u": "https://preview.redd.it/symd8zueanzc1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=2fcf3a0538a06d9766deb5dcc34fe75f96ddfd69"
                                    },
                                    {
                                        "y": 67,
                                        "x": 216,
                                        "u": "https://preview.redd.it/symd8zueanzc1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=1cd7dc96bc4bdaf0242284885928274119808308"
                                    },
                                    {
                                        "y": 99,
                                        "x": 320,
                                        "u": "https://preview.redd.it/symd8zueanzc1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=cd7729d03f14d0283c4d2d604e0c06f89e3a8679"
                                    },
                                    {
                                        "y": 199,
                                        "x": 640,
                                        "u": "https://preview.redd.it/symd8zueanzc1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=3680d76b96e0610597716f6ba33bbaabc15167fa"
                                    },
                                    {
                                        "y": 299,
                                        "x": 960,
                                        "u": "https://preview.redd.it/symd8zueanzc1.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=dd55f131e50459d11a20226e2c37eb614d9bed56"
                                    }
                                ],
                                "s": {
                                    "y": 304,
                                    "x": 975,
                                    "u": "https://preview.redd.it/symd8zueanzc1.png?width=975&amp;format=png&amp;auto=webp&amp;s=176783915281075fdb07a1b83ee6b18f2978f24c"
                                },
                                "id": "symd8zueanzc1"
                            },
                            "0sajvfgkanzc1": {
                                "status": "valid",
                                "e": "Image",
                                "m": "image/png",
                                "p": [
                                    {
                                        "y": 46,
                                        "x": 108,
                                        "u": "https://preview.redd.it/0sajvfgkanzc1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=dc384914bcb4ec06c198e8db3adcdca9edc347cb"
                                    },
                                    {
                                        "y": 92,
                                        "x": 216,
                                        "u": "https://preview.redd.it/0sajvfgkanzc1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=30d6a967ce4cfb71f1523d01a6625039c393003e"
                                    },
                                    {
                                        "y": 136,
                                        "x": 320,
                                        "u": "https://preview.redd.it/0sajvfgkanzc1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=985654f33b34f5ff6da7a6c9abc812a271791af0"
                                    },
                                    {
                                        "y": 273,
                                        "x": 640,
                                        "u": "https://preview.redd.it/0sajvfgkanzc1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=fd37e252ee2b7058066db9d1763afabc2e66abaa"
                                    },
                                    {
                                        "y": 409,
                                        "x": 960,
                                        "u": "https://preview.redd.it/0sajvfgkanzc1.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=b2e43f5d685c4cf4cdc5b3b3ce1255711c61bd65"
                                    }
                                ],
                                "s": {
                                    "y": 416,
                                    "x": 975,
                                    "u": "https://preview.redd.it/0sajvfgkanzc1.png?width=975&amp;format=png&amp;auto=webp&amp;s=3aad16b9df1be7bf6bbcc8f16ebf8c469c15b3a0"
                                },
                                "id": "0sajvfgkanzc1"
                            },
                            "yzcdzgtoanzc1": {
                                "status": "valid",
                                "e": "Image",
                                "m": "image/png",
                                "p": [
                                    {
                                        "y": 81,
                                        "x": 108,
                                        "u": "https://preview.redd.it/yzcdzgtoanzc1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=3a71fce55232659c94bb3274a39f544ed6c07a06"
                                    },
                                    {
                                        "y": 162,
                                        "x": 216,
                                        "u": "https://preview.redd.it/yzcdzgtoanzc1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=9e99e9932235f5d9be1de0fcab2f2cc244f54f70"
                                    },
                                    {
                                        "y": 240,
                                        "x": 320,
                                        "u": "https://preview.redd.it/yzcdzgtoanzc1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=7c9bf29376c5964fcb38f8ae70c9f1f236036931"
                                    }
                                ],
                                "s": {
                                    "y": 395,
                                    "x": 526,
                                    "u": "https://preview.redd.it/yzcdzgtoanzc1.png?width=526&amp;format=png&amp;auto=webp&amp;s=b25fafa6bcdf821a4a36de2cafa09aaa625b67bf"
                                },
                                "id": "yzcdzgtoanzc1"
                            },
                            "qevmp0qaanzc1": {
                                "status": "valid",
                                "e": "Image",
                                "m": "image/png",
                                "p": [
                                    {
                                        "y": 73,
                                        "x": 108,
                                        "u": "https://preview.redd.it/qevmp0qaanzc1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=eb1c72d38545bea2910798ec828eeb3c094c32e8"
                                    },
                                    {
                                        "y": 146,
                                        "x": 216,
                                        "u": "https://preview.redd.it/qevmp0qaanzc1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=f502381aaa8845dfa234cd6f2549cd7e773f066b"
                                    },
                                    {
                                        "y": 216,
                                        "x": 320,
                                        "u": "https://preview.redd.it/qevmp0qaanzc1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=48a434f9b1400b730fdf609c85296bce39951eab"
                                    },
                                    {
                                        "y": 432,
                                        "x": 640,
                                        "u": "https://preview.redd.it/qevmp0qaanzc1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=084b865363f9280d1ab762434dc175e848335a79"
                                    }
                                ],
                                "s": {
                                    "y": 435,
                                    "x": 643,
                                    "u": "https://preview.redd.it/qevmp0qaanzc1.png?width=643&amp;format=png&amp;auto=webp&amp;s=ad031f2035197c31f321a03926d954b33f2357b4"
                                },
                                "id": "qevmp0qaanzc1"
                            },
                            "e7ocu0jdanzc1": {
                                "status": "valid",
                                "e": "Image",
                                "m": "image/png",
                                "p": [
                                    {
                                        "y": 36,
                                        "x": 108,
                                        "u": "https://preview.redd.it/e7ocu0jdanzc1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=ea144e9109eb61d145361f8d64dc39c08337ba37"
                                    },
                                    {
                                        "y": 73,
                                        "x": 216,
                                        "u": "https://preview.redd.it/e7ocu0jdanzc1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=ae07b3bc07ccb700e107ded04502f4c4cac25a6b"
                                    },
                                    {
                                        "y": 109,
                                        "x": 320,
                                        "u": "https://preview.redd.it/e7ocu0jdanzc1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=596f3a938adbb5621ce704cf316b482ace99b822"
                                    },
                                    {
                                        "y": 219,
                                        "x": 640,
                                        "u": "https://preview.redd.it/e7ocu0jdanzc1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=173594c44702d9df2b9855a197fc6f22ec79683f"
                                    },
                                    {
                                        "y": 328,
                                        "x": 960,
                                        "u": "https://preview.redd.it/e7ocu0jdanzc1.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=c14a63d0a5fb759b050e4cf2825b4c7d94cf58ca"
                                    }
                                ],
                                "s": {
                                    "y": 334,
                                    "x": 975,
                                    "u": "https://preview.redd.it/e7ocu0jdanzc1.png?width=975&amp;format=png&amp;auto=webp&amp;s=f8e80b8d743de3dc9133504bd6ff85dbbaee48bb"
                                },
                                "id": "e7ocu0jdanzc1"
                            },
                            "dsu4sxm8anzc1": {
                                "status": "valid",
                                "e": "Image",
                                "m": "image/png",
                                "p": [
                                    {
                                        "y": 61,
                                        "x": 108,
                                        "u": "https://preview.redd.it/dsu4sxm8anzc1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=20e34f3a2734b53df883f37eacb82a7e3fc4a990"
                                    },
                                    {
                                        "y": 122,
                                        "x": 216,
                                        "u": "https://preview.redd.it/dsu4sxm8anzc1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=19bf67b08ab16da42ab2cc4c50055ae0dd252579"
                                    },
                                    {
                                        "y": 180,
                                        "x": 320,
                                        "u": "https://preview.redd.it/dsu4sxm8anzc1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=331504b3d712fc53fd838680ddea70a6c8a92f8d"
                                    },
                                    {
                                        "y": 361,
                                        "x": 640,
                                        "u": "https://preview.redd.it/dsu4sxm8anzc1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=25ed674fd883c7545d525f8ae83479430809c168"
                                    },
                                    {
                                        "y": 542,
                                        "x": 960,
                                        "u": "https://preview.redd.it/dsu4sxm8anzc1.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=9d988e1f17ffb9cf3b3519a9903c7f0889b0119e"
                                    }
                                ],
                                "s": {
                                    "y": 551,
                                    "x": 975,
                                    "u": "https://preview.redd.it/dsu4sxm8anzc1.png?width=975&amp;format=png&amp;auto=webp&amp;s=82be786825f001a4617db95ea6b88795b16aaeb0"
                                },
                                "id": "dsu4sxm8anzc1"
                            },
                            "fru8h8xbanzc1": {
                                "status": "valid",
                                "e": "Image",
                                "m": "image/png",
                                "p": [
                                    {
                                        "y": 38,
                                        "x": 108,
                                        "u": "https://preview.redd.it/fru8h8xbanzc1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=6eca9bc40767bb94b0ca5bfef81b2c42e7afc0eb"
                                    },
                                    {
                                        "y": 77,
                                        "x": 216,
                                        "u": "https://preview.redd.it/fru8h8xbanzc1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=c01c40ad7e9cc01b5a1a177773661bd6020a7220"
                                    },
                                    {
                                        "y": 114,
                                        "x": 320,
                                        "u": "https://preview.redd.it/fru8h8xbanzc1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=80e2f579128d45c3a0021a4d1d76c1de632dc3f3"
                                    },
                                    {
                                        "y": 229,
                                        "x": 640,
                                        "u": "https://preview.redd.it/fru8h8xbanzc1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=f56333ff8e227dfdf2992ef331b2934191d108b9"
                                    }
                                ],
                                "s": {
                                    "y": 245,
                                    "x": 683,
                                    "u": "https://preview.redd.it/fru8h8xbanzc1.png?width=683&amp;format=png&amp;auto=webp&amp;s=5a9e6014be0a78d76582c962afb0219ebfd53778"
                                },
                                "id": "fru8h8xbanzc1"
                            },
                            "5dwt225qanzc1": {
                                "status": "valid",
                                "e": "Image",
                                "m": "image/png",
                                "p": [
                                    {
                                        "y": 79,
                                        "x": 108,
                                        "u": "https://preview.redd.it/5dwt225qanzc1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=adb9c24a1b276fd88a3eaa8f16aa218dba59f4ee"
                                    },
                                    {
                                        "y": 158,
                                        "x": 216,
                                        "u": "https://preview.redd.it/5dwt225qanzc1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=905006d14cf12aa796f5567c5fccb75db8f467d0"
                                    },
                                    {
                                        "y": 234,
                                        "x": 320,
                                        "u": "https://preview.redd.it/5dwt225qanzc1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=438569bb8cb1e0ebd40a3ffba0afed9b10b54b68"
                                    }
                                ],
                                "s": {
                                    "y": 378,
                                    "x": 515,
                                    "u": "https://preview.redd.it/5dwt225qanzc1.png?width=515&amp;format=png&amp;auto=webp&amp;s=09f25d4e92c17667ae4129e1d28e0b3a0be59a9b"
                                },
                                "id": "5dwt225qanzc1"
                            },
                            "cbanlyvlanzc1": {
                                "status": "valid",
                                "e": "Image",
                                "m": "image/png",
                                "p": [
                                    {
                                        "y": 51,
                                        "x": 108,
                                        "u": "https://preview.redd.it/cbanlyvlanzc1.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=c71dbb1ed0d2a9e2be372a91a1e888322b926289"
                                    },
                                    {
                                        "y": 102,
                                        "x": 216,
                                        "u": "https://preview.redd.it/cbanlyvlanzc1.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=1e01fd0e50cbf1b7b885591db7a941167679684c"
                                    },
                                    {
                                        "y": 151,
                                        "x": 320,
                                        "u": "https://preview.redd.it/cbanlyvlanzc1.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=a7e353a2ed7a56df00594434c2f5cd5f9468be32"
                                    },
                                    {
                                        "y": 303,
                                        "x": 640,
                                        "u": "https://preview.redd.it/cbanlyvlanzc1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=564b2594394b75a4f9e006e4494d312b4a684c7e"
                                    },
                                    {
                                        "y": 454,
                                        "x": 960,
                                        "u": "https://preview.redd.it/cbanlyvlanzc1.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=468788d33e6ade05cf17cd4d5531ef4a4eea193d"
                                    }
                                ],
                                "s": {
                                    "y": 462,
                                    "x": 975,
                                    "u": "https://preview.redd.it/cbanlyvlanzc1.png?width=975&amp;format=png&amp;auto=webp&amp;s=537d2414b3c56538902bbf1594f78fe77b44f089"
                                },
                                "id": "cbanlyvlanzc1"
                            }
                        },
                        "name": "t3_1cowzid",
                        "quarantine": false,
                        "link_flair_text_color": "dark",
                        "upvote_ratio": 0.86,
                        "author_flair_background_color": "#24a0ed",
                        "subreddit_type": "public",
                        "ups": 5,
                        "total_awards_received": 0,
                        "media_embed": {},
                        "thumbnail_width": 140,
                        "author_flair_template_id": "d8b24326-ea6a-11eb-8d3f-0e7f7aabdce7",
                        "is_original_content": false,
                        "author_fullname": "t2_2gf2r6qk",
                        "secure_media": null,
                        "is_reddit_media_domain": false,
                        "is_meta": false,
                        "category": null,
                        "secure_media_embed": {},
                        "link_flair_text": null,
                        "can_mod_post": false,
                        "score": 5,
                        "approved_by": null,
                        "is_created_from_ads_ui": false,
                        "author_premium": false,
                        "thumbnail": "https://b.thumbs.redditmedia.com/SD3ymf1LwXfbDO-8oRDeE3dazh-mTtgZOBzyYSwTaRM.jpg",
                        "edited": false,
                        "author_flair_css_class": null,
                        "author_flair_richtext": [],
                        "gildings": {},
                        "post_hint": "self",
                        "content_categories": null,
                        "is_self": true,
                        "mod_note": null,
                        "created": 1715367004.0,
                        "link_flair_type": "text",
                        "wls": null,
                        "removed_by_category": null,
                        "banned_by": null,
                        "author_flair_type": "text",
                        "domain": "self.BurryEdge",
                        "allow_live_comments": false,
                        "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I run a small hedge fund based out of Raleigh, NC. Myself and my Fund are long $HAYPP. Please see the disclaimer at the bottom of the post. For more blog posts like this check out my Fund&amp;#39;s blog at &lt;a href=\"https://www.rogue-funds.com/blog\"&gt;https://www.rogue-funds.com/blog&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;All Financial Figures are in USD unless otherwise specified.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I think HAYPP Group, the biggest online retailer of nicotine pouches, can capture a huge chunk of the sales in what I believe will be the biggest form of nicotine intake growth over the next 10-15 years.&lt;/p&gt;\n\n&lt;p&gt;The future of nicotine consumption will be nicotine pouches and it is growing at an unprecedented rate. Here in the States the go to item for nicotine pouches are Zyn’s (owned by Philip Morris), in Europe it’s Velo (owned by British American Tobacco), but there are various other brands that all catching fire: ON! (Altria), Rogue, Juice Head, FRE, Lucy, and Sesh, among various others.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What is HAYPP?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Brief History&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;HAYPP is an online retailer and distributor of nicotine pouches and snus. The company was started by a couple of Swedish teenagers in 2009 and through mergers and acquisitions they no longer are in charge of the company as the current CEO joined in 2017/2018. The company bought Nicokick.com and northerner.com (northerner owns 9% of stock) which are now both of their main American brands. They switched from Snus to Nicotine Pouches 6 years ago and haven’t looked back.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/gr3kxwm5anzc1.png?width=975&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=383bb5d7ac692fe7323192c608ae812b46f4e7c1\"&gt;Domains Owned By HAYPP Group&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;HAYPP currently owns a roughly 85% online market share for their Nordic part of the business, which they refer to as their “core” business as well as a ~55% market share of the oral nicotine market (85% market share of the nicotine pouch e-commerce market) for their growth market which is considered the US, UK, Germany, and Swiss countries.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/r9y53fg7anzc1.png?width=975&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=b11912ca8e532bc15d9b2d918bc4fa2673c3a917\"&gt;Market Share of HAYPP&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/dsu4sxm8anzc1.png?width=975&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=82be786825f001a4617db95ea6b88795b16aaeb0\"&gt;HAYPP vs Closest Competitor in each Market&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;SEO Powerhouse&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;So how do they have such a grasp on what would obviously be a hyper competitive online industry? The main reason for their hyper success in the online market is that they have a death grip on the SEO landscape. Their mastery of SEO allows them to spend almost nothing on marketing and to keep pushing out their distribution system (which continues to drive costs down for them and consumers). This creates a positive feedback loop as they become even cheaper than their competitors, allowing them to lock in customers (over 90% of the customers becoming recurring customers).&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/qevmp0qaanzc1.png?width=643&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=ad031f2035197c31f321a03926d954b33f2357b4\"&gt;How Consumers find HAYPP&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/fru8h8xbanzc1.png?width=683&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=5a9e6014be0a78d76582c962afb0219ebfd53778\"&gt;HAYPP Marketing Expenses as a &amp;#37; of Sales&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;If you google just about anything related to Nicotine pouches, there is probably a 95%+ chance that the top unpaid search result will be a HAYPP Group Domain. Even niche searches such as “what is an upper decky” (Gen. Z slang for nicotine pouches) or basic searches such as “what are the top nicotine pouches” you will see that HAYPP Group owns the top of the search.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/e7ocu0jdanzc1.png?width=975&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=f8e80b8d743de3dc9133504bd6ff85dbbaee48bb\"&gt;https://preview.redd.it/e7ocu0jdanzc1.png?width=975&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=f8e80b8d743de3dc9133504bd6ff85dbbaee48bb&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/symd8zueanzc1.png?width=975&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=176783915281075fdb07a1b83ee6b18f2978f24c\"&gt;Google Searches Highlighting the SEO power of HAYPP&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This is huge when sites like Google severely limit the amount of advertising that addictive products can utilize on their search engine. HAYPP ends up barely spending anything on marketing due to 40% of new customers coming through word of mouth and the rest from SEO.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Data&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Their other field of expertise is data collection and selling. Due to the large variety of pouches and being the number one online seller of nicotine pouches, they have created a major database which they sell to various nicotine pouch producers such as Philip Morris and Altria. Producers buy these on an annualized basis, and you can see the usage of their data among the investor relation reports/presentations/websites of various producers. As you can see from my beautiful pictures on this post, they compile plenty of data to help me understand the business better.&lt;/p&gt;\n\n&lt;p&gt; &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Lowest Cost Seller and Best E-Commerce Distribution&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Due to their distribution network, HAYPP has become one of the cheapest (if not the cheapest) sellers of nicotine pouches in the world. You can buy Zyn’s cheaper from HAYPP websites than you can from the ZYN website. Haypp’s prices are 20-40% cheaper than grocery stores and 30-50% cheaper than convenience stores.&lt;/p&gt;\n\n&lt;p&gt;They have been integrating their distribution network so that most variable costs are being converted to vertical fixed costs creating operating leverage for them as they rapidly scale their revenue and are able to increase margins. They have implemented 2-day delivery across the US and close to implementing across Europe markets as well.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/0sajvfgkanzc1.png?width=975&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=3aad16b9df1be7bf6bbcc8f16ebf8c469c15b3a0\"&gt;https://preview.redd.it/0sajvfgkanzc1.png?width=975&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=3aad16b9df1be7bf6bbcc8f16ebf8c469c15b3a0&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/cbanlyvlanzc1.png?width=975&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=537d2414b3c56538902bbf1594f78fe77b44f089\"&gt;HAYPP Distribution&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Leveraging Market Share for High Quality New Products&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;The last part of their business model is their ability to leverage their large consumer base to help new products capture market share, which allows them to capture higher margins on their products and it increases the variety of products which consumers would like to buy. In Nordic countries the variety of products is a benefit to them as consumers want to try various brands and flavors. When this competition trend hits the US it will only benefit them even more.&lt;/p&gt;\n\n&lt;p&gt; &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Why Haypp vs Pouch Companies&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Currently in the US there are only a couple main brands with Zyn owning a huge chunk of the market. In Europe, Velo is the most popular brand but there are many Nordic brands that consistently attack margins and currently there is little competition in the US market which most likely won’t last much longer. As consumers search out the cheapest product and try to hunt for variety, HAYPP will be that future as convenience stores lag in variety and cost.&lt;/p&gt;\n\n&lt;p&gt;Products such as Zyn will definitely continue to grow (currently Zyn is growing at 70% y/y) but we could see margins shrink as competition becomes fiercer and consumers branch out away from the first movers, although Zyn continues to take up 70% of the US market. This only further benefits HAYPP as they are the go-to spot for a large amount of variety. Although they don’t benefit as much from less competition, they are still beneficiaries of an oligopoly esque market due to their cost and distribution networks.&lt;/p&gt;\n\n&lt;p&gt;Most large publicly traded pouch companies are also cigarette and chewing tobacco sellers who are rapidly seeing those segments get cannibalized by vaping and nicotine pouches combined with regulatory crackdown risk. Since HAYPP has no exposure to either one, you will not experience any cannibalization outside of snus cannibalization in the Nordics. This is the best pure play bet on nicotine pouch consumption.&lt;/p&gt;\n\n&lt;p&gt;Certain countries have limited the ability for consumers to have access to nicotine via retail stores which will allow them to take huge shares of the overall market in places like Germany or in California where they have banned flavored nicotine products in retail stores has led to windfall of customers to HAYPP’s e-commerce model.&lt;/p&gt;\n\n&lt;p&gt; &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Management&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The current CEO of HAYPP group, Gavin O’Dowd, used to work for British American Tobacco (BAT) and was the driving force for the VELO acquisition. He currently owns 3.6% of the stock and various other PE firms and Family Offices own large chunks of HAYPP. Most executives have warrants that could give them the right to 200k-400k shares each (29m shares outstanding with no serious history of dilution).&lt;/p&gt;\n\n&lt;p&gt; &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Regulations&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;As many of you are aware, regulations are a huge part of the nicotine industry. Taxes are going to be huge risks, which are then combined with flavor bans. I think nicotine pouches are one of the products that are least likely to get hit with serious bans since their health risk is much lower than almost any other nicotine product.&lt;/p&gt;\n\n&lt;p&gt;The nicotine pouch industry as a whole has been behaving spectacularly well when it comes to ensuring they are not purposefully marketing to young people. They are trying to avoid having a Juul 2.0 fiasco which basically murdered that business and completely fragmented the vaping industry which is on the brink of regulatory crack down.&lt;/p&gt;\n\n&lt;p&gt;HAYPP does their part by ensuring age regulation across their whole site. They have age verification to order and deliver. They have a huge emphasis on ensuring that they abide by the law.&lt;/p&gt;\n\n&lt;p&gt; &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Financials&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Core Segment (Nordic Countries)&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;The company is growing heavily in every segment that it operates in. Its core segment seems to be slowing down in growth due to heavy cannibalization from snus sales. This should only be temporary as nicotine pouch volume grows at 30%+ y/y. Once snus nears its cannibalization endpoint, I would expect revenue to begin growing again in its core market (although not at 30%). Current revenue is $250m USD and EBITDA is about $18m USD for just the core segment for the last twelve months. Management expects high single digit EBITDA margins for 2025.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/yzcdzgtoanzc1.png?width=526&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=b25fafa6bcdf821a4a36de2cafa09aaa625b67bf\"&gt;Core Segment Sales and EBITDA Margin&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Growth Segment (US, UK, Germany, Switzerland)&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;The growth segment is skyrocketing. Growth is over 46% y/y and this growth has been consistent and should continue to be consistent. EBITDA margin for the growth markets has begun to inflect positively which will cause a massive amount of leverage in their EBITDA to occur as their fixed cost model begins to do its job. As economies of scale drive forward, we should see this margin increase substantially over the coming years. Currently Revenue is at $77m USD for growth markets and EBITDA is at -$3.5m USD.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/5dwt225qanzc1.png?width=515&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=09f25d4e92c17667ae4129e1d28e0b3a0be59a9b\"&gt;Growth Segment Sales and EBITDA Margin&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Let’s Talk about the Growth Segment a bit more.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;This is where the real value from HAYPP will come into play. While it currently begins to inflect positive in terms of profitability, it should be noted that the Growth markets have a massive TAM compared to their core market and could cause the company to 5x in the next few years if they maintain or gain market share and continue to grow in these massive TAMs.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Total TAM growth&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;As they grow, their competitive advantage deepens due to sticky customers and cheaper products from economies of scale. The US has an even faster scale of 49%+ growth y/y and HAYPP is outpacing the US nicotine pouch growth at 57% y/y. As the US begins to approve various products and variety begins to flood the US market, a ton of US users want to try various Nordic brands that don’t have access which lends a very strong lean towards an online website such as HAYPP. The US is a very ripe environment along with the UK and Germany (where nicotine can only be sold online) for HAYPP to continue to outperform massively.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Emerging Segment&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Their “emerging” segment is where they have begun to introduce vapes into their value chain. HAYPP is beginning to sell vapes to UK and Germany, but it is at the very beginning stages and has no current significant impact on their bottom or top line. The company says the growth they are experiencing in this segment has been very similar to the growth that they experienced when they introduced Nicotine Pouches in growth markets. This is the most likely segment to get hit with regulatory concerns, so for now I won’t even consider this in a to be a profitable unit and will just assume it will be a small drain on EBITDA for the foreseeable future.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Balance Sheet&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;The balance sheet is great with no large debt burden and good working capital management. As they hit profitability this year/early next year I would expect a cash build up until the company decides if they will be returning cash to shareholders or reinvesting in the business.&lt;/p&gt;\n\n&lt;p&gt; &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Valuation&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;HAYPP is extremely undervalued based on where they are from a profitability standpoint and their current inflection point. Due to their high growth, it will be hard to pinpoint an exact value on them so this will merely be an exercise in estimating their value among a range more than usual (anyone who claims they can perfectly value a high growth company is probably overvaluing due to unsound conviction).&lt;/p&gt;\n\n&lt;p&gt; First let’s look at how they are currently valued, which is roughly 14x their &lt;strong&gt;core&lt;/strong&gt; EBITDA. Now let’s take a second and think about how insane that statement was. Their core market is the Nordic countries which will be hitting growth again as their snus cannibalization slows, the Nordic countries basically have no further regulation risk for nicotine pouches, and it is a noncyclical industry. I would argue that 14x their core EBITDA is probably an appropriate valuation based on &lt;strong&gt;only&lt;/strong&gt; their core segment.&lt;/p&gt;\n\n&lt;p&gt;What this means is (if you haven’t noticed already) that you are getting their “growth” segment for &lt;strong&gt;free&lt;/strong&gt; based on the valuation of the stock. The growth segment alone is probably worth multiples of the current stock price due to the massive TAM and extreme growth prospects. If we assume the emerging segment is worthless (which it isn’t and it will be profitable at some point) then that means all of the upside in the stock can be based on what the value of the growth segment. Based on TAM, growth, and lack of cyclicality then this leaves the only risk as regulation.&lt;/p&gt;\n\n&lt;p&gt;There will most likely be some sort of regulation, but we are very far from that as the Tobacco industry has been very careful in how they implement their new nicotine pouch momentum in a more appropriate way compared to vapes. The most likely regulations will probably be flavor bans of some sort or retail bans (which further benefits HAYPP). Regulations will most likely be limited in scope due to just the sheer lack of mortality risk associated with pouches vs any other form of common nicotine intake.&lt;/p&gt;\n\n&lt;p&gt;Based on their probable conservative revenue growth (40% average for the next 3 years, and 15% after that), EBITDA growth, the fact that they will have both core and growth markets at high single digit EBITDA margins in 2025, and their lack of cyclicality, then I would estimate that their Growth markets are worth a very conservative $400m-$500m USD. I am likely undershooting the valuation because they are driving profitability very fast and their revenue is growing closer to 40%-60% in growth markets right now. If they are able to keep up current growth figures and expand to double digit margins before the end of the decade then they could be worth 2x-3x this value (which is why valuing growth companies are so hard, because I can’t foresee the future). Again, I valued the emerging segment as worthless which is unlikely as well.&lt;/p&gt;\n\n&lt;p&gt;So, based on the value of $450m USD for the growth markets and the current value of $240 USD for the Nordic markets, that would create a sum of the parts equal to roughly $700m or nearly triple the current share price. This valuation leaves a ton of room for margin expansion and higher growth prospects because let’s face it, the US alone is probably worth at least 3x-5x more than the Nordic countries not including the UK, Germany, or Swiss. This is a very conservative valuation for the company, but it shows how great the risk/reward is based on the current price. Using a conservative valuation here also helps accommodate for regulation risk.&lt;/p&gt;\n\n&lt;p&gt;In SEK terms this would be 250 SEK/share or 7.35B SEK.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Conclusion&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Even accommodating for regulation risk, a valuation of $700m seems appropriate as a starting point for the valuation for HAYPP Group. I think there is a very high likelihood that I could be off on this by a large margin, but I feel like the downside is very protected with this valuation. Management has been great in execution and I expect that to continue. In a more bullish case where every segment of the company fires on all cylinders we could see a valuation of $1.5B+, but that is not a scenario that I would like to bet my investors’ money on. For now, I will stay invested and keep watching them execute and adjust my valuation accordingly.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Disclaimer: The author of this idea and his Fund have a position in securities discussed at the time of posting and may trade in and out of this position without informing the reader.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Opinions expressed herein by the author are not an investment recommendation and are not meant to be relied upon in investment decisions. The author is not acting in an investment adviser capacity. This is not an investment research report. The author&amp;#39;s opinions expressed herein address only select aspects of potential investment in securities of the companies mentioned and cannot be a substitute for comprehensive investment analysis. Any analysis presented herein is illustrative in nature, limited in scope, based on an incomplete set of information, and has limitations to its accuracy. The author recommends that potential and existing investors conduct thorough investment research of their own, including detailed review of the companies&amp;#39; SEC and CSA filings, and consult a qualified investment adviser. The information upon which this material is based was obtained from sources believed to be reliable, but has not been independently verified. Therefore, the author cannot guarantee its accuracy. Any opinions or estimates constitute the author&amp;#39;s best judgment as of the date of publication and are subject to change without notice. The author and funds the author advises may buy or sell shares without any further notice.&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;This article may contain certain opinions and “forward-looking statements,” which may be identified by the use of such words as “believe,” “expect,” “anticipate,” “should,” “planned,” “estimated,” “potential,” “outlook,” “forecast,” “plan” and other similar terms. All such opinions and forward-looking statements are conditional and are subject to various factors, including, without limitation, general and local economic conditions, changing levels of competition within certain industries and markets, changes in legislation or regulation, and other economic, competitive, governmental, regulatory and technological factors, any or all of which could cause actual results to differ materially from projected results.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                        "likes": null,
                        "suggested_sort": null,
                        "banned_at_utc": null,
                        "view_count": null,
                        "archived": false,
                        "no_follow": false,
                        "is_crosspostable": false,
                        "pinned": false,
                        "over_18": false,
                        "preview": {
                            "images": [
                                {
                                    "source": {
                                        "url": "https://external-preview.redd.it/rIITinOYlasX6KbiZwOtjthWQq4XJRih8m5HpAtGMJ0.jpg?auto=webp&amp;s=1cba00664eb51ec0632fd4e4526bead886ac646c",
                                        "width": 1500,
                                        "height": 844
                                    },
                                    "resolutions": [
                                        {
                                            "url": "https://external-preview.redd.it/rIITinOYlasX6KbiZwOtjthWQq4XJRih8m5HpAtGMJ0.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=21d9153690c603a908e196c8ba1d500cbb615e79",
                                            "width": 108,
                                            "height": 60
                                        },
                                        {
                                            "url": "https://external-preview.redd.it/rIITinOYlasX6KbiZwOtjthWQq4XJRih8m5HpAtGMJ0.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=0f90688187597e32f3efc5ef77037f94daa4ee22",
                                            "width": 216,
                                            "height": 121
                                        },
                                        {
                                            "url": "https://external-preview.redd.it/rIITinOYlasX6KbiZwOtjthWQq4XJRih8m5HpAtGMJ0.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=c1d90db039f7ff3713b2522e1644b729b8175695",
                                            "width": 320,
                                            "height": 180
                                        },
                                        {
                                            "url": "https://external-preview.redd.it/rIITinOYlasX6KbiZwOtjthWQq4XJRih8m5HpAtGMJ0.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=939abc139803f3077ebd291d8924dbb5de8a2ae4",
                                            "width": 640,
                                            "height": 360
                                        },
                                        {
                                            "url": "https://external-preview.redd.it/rIITinOYlasX6KbiZwOtjthWQq4XJRih8m5HpAtGMJ0.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=2e952811ee9600181faafa09f1e708376c59ce17",
                                            "width": 960,
                                            "height": 540
                                        },
                                        {
                                            "url": "https://external-preview.redd.it/rIITinOYlasX6KbiZwOtjthWQq4XJRih8m5HpAtGMJ0.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=5b1d62b5e9ba85901de194ce22b6f85799b87b0b",
                                            "width": 1080,
                                            "height": 607
                                        }
                                    ],
                                    "variants": {},
                                    "id": "BE2qHlXNAb19F4T1DcgKliQmHnee09XG89Kaw9ArdE8"
                                }
                            ],
                            "enabled": false
                        },
                        "all_awardings": [],
                        "awarders": [],
                        "media_only": false,
                        "can_gild": false,
                        "spoiler": false,
                        "locked": false,
                        "author_flair_text": "Burry Edge Chairman",
                        "treatment_tags": [],
                        "visited": false,
                        "removed_by": null,
                        "num_reports": null,
                        "distinguished": null,
                        "subreddit_id": "t5_4r5401",
                        "author_is_blocked": false,
                        "mod_reason_by": null,
                        "removal_reason": null,
                        "link_flair_background_color": "",
                        "id": "1cowzid",
                        "is_robot_indexable": true,
                        "num_duplicates": 0,
                        "report_reasons": null,
                        "author": "captnamurica2",
                        "discussion_type": null,
                        "num_comments": 4,
                        "send_replies": true,
                        "media": null,
                        "contest_mode": false,
                        "author_patreon_flair": false,
                        "author_flair_text_color": "dark",
                        "permalink": "/r/BurryEdge/comments/1cowzid/haypp_group_capitalizing_on_the_nicotine_pouch/",
                        "whitelist_status": null,
                        "stickied": false,
                        "url": "https://www.reddit.com/r/BurryEdge/comments/1cowzid/haypp_group_capitalizing_on_the_nicotine_pouch/",
                        "subreddit_subscribers": 2368,
                        "created_utc": 1715367004.0,
                        "num_crossposts": 0,
                        "mod_reports": [],
                        "is_video": false
                    }
                }
            ],
            "before": null
        }
    },
    {
        "kind": "Listing",
        "data": {
            "after": null,
            "dist": null,
            "modhash": "",
            "geo_filter": "",
            "children": [
                {
                    "kind": "t1",
                    "data": {
                        "subreddit_id": "t5_4r5401",
                        "approved_at_utc": null,
                        "author_is_blocked": false,
                        "comment_type": null,
                        "awarders": [],
                        "mod_reason_by": null,
                        "banned_by": null,
                        "author_flair_type": "text",
                        "total_awards_received": 0,
                        "subreddit": "BurryEdge",
                        "author_flair_template_id": null,
                        "likes": null,
                        "replies": {
                            "kind": "Listing",
                            "data": {
                                "after": null,
                                "dist": null,
                                "modhash": "",
                                "geo_filter": "",
                                "children": [
                                    {
                                        "kind": "t1",
                                        "data": {
                                            "subreddit_id": "t5_4r5401",
                                            "approved_at_utc": null,
                                            "author_is_blocked": false,
                                            "comment_type": null,
                                            "awarders": [],
                                            "mod_reason_by": null,
                                            "banned_by": null,
                                            "author_flair_type": "text",
                                            "total_awards_received": 0,
                                            "subreddit": "BurryEdge",
                                            "author_flair_template_id": "d8b24326-ea6a-11eb-8d3f-0e7f7aabdce7",
                                            "likes": null,
                                            "replies": "",
                                            "user_reports": [],
                                            "saved": false,
                                            "id": "l3j0b44",
                                            "banned_at_utc": null,
                                            "mod_reason_title": null,
                                            "gilded": 0,
                                            "archived": false,
                                            "collapsed_reason_code": null,
                                            "no_follow": true,
                                            "author": "captnamurica2",
                                            "can_mod_post": false,
                                            "created_utc": 1715397520.0,
                                            "send_replies": true,
                                            "parent_id": "t1_l3icmw0",
                                            "score": 2,
                                            "author_fullname": "t2_2gf2r6qk",
                                            "removal_reason": null,
                                            "approved_by": null,
                                            "mod_note": null,
                                            "all_awardings": [],
                                            "body": "Thanks!",
                                            "edited": false,
                                            "top_awarded_type": null,
                                            "author_flair_css_class": null,
                                            "name": "t1_l3j0b44",
                                            "is_submitter": true,
                                            "downs": 0,
                                            "author_flair_richtext": [],
                                            "author_patreon_flair": false,
                                            "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks!&lt;/p&gt;\n&lt;/div&gt;",
                                            "gildings": {},
                                            "collapsed_reason": null,
                                            "distinguished": null,
                                            "associated_award": null,
                                            "stickied": false,
                                            "author_premium": false,
                                            "can_gild": false,
                                            "link_id": "t3_1cowzid",
                                            "unrepliable_reason": null,
                                            "author_flair_text_color": "dark",
                                            "score_hidden": false,
                                            "permalink": "/r/BurryEdge/comments/1cowzid/haypp_group_capitalizing_on_the_nicotine_pouch/l3j0b44/",
                                            "subreddit_type": "public",
                                            "locked": false,
                                            "report_reasons": null,
                                            "created": 1715397520.0,
                                            "author_flair_text": "Burry Edge Chairman",
                                            "treatment_tags": [],
                                            "collapsed": false,
                                            "subreddit_name_prefixed": "r/BurryEdge",
                                            "controversiality": 0,
                                            "depth": 1,
                                            "author_flair_background_color": "#24a0ed",
                                            "collapsed_because_crowd_control": null,
                                            "mod_reports": [],
                                            "num_reports": null,
                                            "ups": 2
                                        }
                                    }
                                ],
                                "before": null
                            }
                        },
                        "user_reports": [],
                        "saved": false,
                        "id": "l3icmw0",
                        "banned_at_utc": null,
                        "mod_reason_title": null,
                        "gilded": 0,
                        "archived": false,
                        "collapsed_reason_code": null,
                        "no_follow": true,
                        "author": "izzeww",
                        "can_mod_post": false,
                        "created_utc": 1715386790.0,
                        "send_replies": true,
                        "parent_id": "t3_1cowzid",
                        "score": 2,
                        "author_fullname": "t2_yw3y5",
                        "approved_by": null,
                        "mod_note": null,
                        "all_awardings": [],
                        "collapsed": false,
                        "body": "This is an excellent write-up, thank you. Very little interest in this company on Swedish fintwit (&amp; other investor circles). I haven't looked at it myself even, but will take a look now.",
                        "edited": false,
                        "top_awarded_type": null,
                        "author_flair_css_class": null,
                        "name": "t1_l3icmw0",
                        "is_submitter": false,
                        "downs": 0,
                        "author_flair_richtext": [],
                        "author_patreon_flair": false,
                        "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is an excellent write-up, thank you. Very little interest in this company on Swedish fintwit (&amp;amp; other investor circles). I haven&amp;#39;t looked at it myself even, but will take a look now.&lt;/p&gt;\n&lt;/div&gt;",
                        "removal_reason": null,
                        "collapsed_reason": null,
                        "distinguished": null,
                        "associated_award": null,
                        "stickied": false,
                        "author_premium": false,
                        "can_gild": false,
                        "gildings": {},
                        "unrepliable_reason": null,
                        "author_flair_text_color": null,
                        "score_hidden": false,
                        "permalink": "/r/BurryEdge/comments/1cowzid/haypp_group_capitalizing_on_the_nicotine_pouch/l3icmw0/",
                        "subreddit_type": "public",
                        "locked": false,
                        "report_reasons": null,
                        "created": 1715386790.0,
                        "author_flair_text": null,
                        "treatment_tags": [],
                        "link_id": "t3_1cowzid",
                        "subreddit_name_prefixed": "r/BurryEdge",
                        "controversiality": 0,
                        "depth": 0,
                        "author_flair_background_color": null,
                        "collapsed_because_crowd_control": null,
                        "mod_reports": [],
                        "num_reports": null,
                        "ups": 2
                    }
                },
                {
                    "kind": "t1",
                    "data": {
                        "subreddit_id": "t5_4r5401",
                        "approved_at_utc": null,
                        "author_is_blocked": false,
                        "comment_type": null,
                        "awarders": [],
                        "mod_reason_by": null,
                        "banned_by": null,
                        "author_flair_type": "text",
                        "total_awards_received": 0,
                        "subreddit": "BurryEdge",
                        "author_flair_template_id": null,
                        "likes": null,
                        "replies": {
                            "kind": "Listing",
                            "data": {
                                "after": null,
                                "dist": null,
                                "modhash": "",
                                "geo_filter": "",
                                "children": [
                                    {
                                        "kind": "t1",
                                        "data": {
                                            "subreddit_id": "t5_4r5401",
                                            "approved_at_utc": null,
                                            "author_is_blocked": false,
                                            "comment_type": null,
                                            "awarders": [],
                                            "mod_reason_by": null,
                                            "banned_by": null,
                                            "author_flair_type": "text",
                                            "total_awards_received": 0,
                                            "subreddit": "BurryEdge",
                                            "author_flair_template_id": "d8b24326-ea6a-11eb-8d3f-0e7f7aabdce7",
                                            "likes": null,
                                            "replies": "",
                                            "user_reports": [],
                                            "saved": false,
                                            "id": "l47p1t3",
                                            "banned_at_utc": null,
                                            "mod_reason_title": null,
                                            "gilded": 0,
                                            "archived": false,
                                            "collapsed_reason_code": null,
                                            "no_follow": true,
                                            "author": "captnamurica2",
                                            "can_mod_post": false,
                                            "created_utc": 1715806589.0,
                                            "send_replies": true,
                                            "parent_id": "t1_l47o0ne",
                                            "score": 2,
                                            "author_fullname": "t2_2gf2r6qk",
                                            "removal_reason": null,
                                            "approved_by": null,
                                            "mod_note": null,
                                            "all_awardings": [],
                                            "body": "Not much, will be $1m - $1.4m at the end of the month. Started out at $100k last year though so can’t complain and I’m having a blast!",
                                            "edited": false,
                                            "top_awarded_type": null,
                                            "author_flair_css_class": null,
                                            "name": "t1_l47p1t3",
                                            "is_submitter": true,
                                            "downs": 0,
                                            "author_flair_richtext": [],
                                            "author_patreon_flair": false,
                                            "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not much, will be $1m - $1.4m at the end of the month. Started out at $100k last year though so can’t complain and I’m having a blast!&lt;/p&gt;\n&lt;/div&gt;",
                                            "gildings": {},
                                            "collapsed_reason": null,
                                            "distinguished": null,
                                            "associated_award": null,
                                            "stickied": false,
                                            "author_premium": false,
                                            "can_gild": false,
                                            "link_id": "t3_1cowzid",
                                            "unrepliable_reason": null,
                                            "author_flair_text_color": "dark",
                                            "score_hidden": false,
                                            "permalink": "/r/BurryEdge/comments/1cowzid/haypp_group_capitalizing_on_the_nicotine_pouch/l47p1t3/",
                                            "subreddit_type": "public",
                                            "locked": false,
                                            "report_reasons": null,
                                            "created": 1715806589.0,
                                            "author_flair_text": "Burry Edge Chairman",
                                            "treatment_tags": [],
                                            "collapsed": false,
                                            "subreddit_name_prefixed": "r/BurryEdge",
                                            "controversiality": 0,
                                            "depth": 1,
                                            "author_flair_background_color": "#24a0ed",
                                            "collapsed_because_crowd_control": null,
                                            "mod_reports": [],
                                            "num_reports": null,
                                            "ups": 2
                                        }
                                    }
                                ],
                                "before": null
                            }
                        },
                        "user_reports": [],
                        "saved": false,
                        "id": "l47o0ne",
                        "banned_at_utc": null,
                        "mod_reason_title": null,
                        "gilded": 0,
                        "archived": false,
                        "collapsed_reason_code": null,
                        "no_follow": true,
                        "author": "WhiteHeatBlackLight",
                        "can_mod_post": false,
                        "created_utc": 1715806228.0,
                        "send_replies": true,
                        "parent_id": "t3_1cowzid",
                        "score": 1,
                        "author_fullname": "t2_88wue8b1",
                        "approved_by": null,
                        "mod_note": null,
                        "all_awardings": [],
                        "collapsed": false,
                        "body": "What's your aum incidentally",
                        "edited": false,
                        "top_awarded_type": null,
                        "author_flair_css_class": null,
                        "name": "t1_l47o0ne",
                        "is_submitter": false,
                        "downs": 0,
                        "author_flair_richtext": [],
                        "author_patreon_flair": false,
                        "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What&amp;#39;s your aum incidentally&lt;/p&gt;\n&lt;/div&gt;",
                        "removal_reason": null,
                        "collapsed_reason": null,
                        "distinguished": null,
                        "associated_award": null,
                        "stickied": false,
                        "author_premium": false,
                        "can_gild": false,
                        "gildings": {},
                        "unrepliable_reason": null,
                        "author_flair_text_color": null,
                        "score_hidden": false,
                        "permalink": "/r/BurryEdge/comments/1cowzid/haypp_group_capitalizing_on_the_nicotine_pouch/l47o0ne/",
                        "subreddit_type": "public",
                        "locked": false,
                        "report_reasons": null,
                        "created": 1715806228.0,
                        "author_flair_text": null,
                        "treatment_tags": [],
                        "link_id": "t3_1cowzid",
                        "subreddit_name_prefixed": "r/BurryEdge",
                        "controversiality": 0,
                        "depth": 0,
                        "author_flair_background_color": null,
                        "collapsed_because_crowd_control": null,
                        "mod_reports": [],
                        "num_reports": null,
                        "ups": 1
                    }
                }
            ],
            "before": null
        }
    }
]